export default {
  menu: {
    cv: 'Резюме',
    contacts: 'Контакты'
  },
  navigation: {
    mainPage: 'Главная',
    cv: 'Резюме',
    contacts: 'Контакты'
  },
  profile: {
    fullName: 'Злобин Евгений',
    description: 'Разработчик программного обеспечения. Меня вдохновляют новые технологии, построение современных, надёжных и быстрых web-приложений. Я стремлюсь к совершенству во всех своих начинаниях - профессиональных и персональных.'
  },
  contacts: {
    getInTouch: 'Оставайтесь на связи!',
    skype: 'Скайп',
    email: 'Электронная почта',
    phone: 'Телефон'
  },
  contribution: {
    title: 'Вклад в Open-Source',
    esAjax: 'ajax (fetch или xhr2) на промисах - JavaScript библиотека для удобного управления асинхронными запросами в браузере',
    esDatabinding: 'библиотека для дву-направленного связывания данных',
    esMiddleware: 'реализация middleware паттерна',
    gulpTojst: 'gulp плагин для компиляции lodash (underscore) шаблонов в единый JST файл',
    frontEndStarterKit: 'лёгкий путь для старта нового фронт-энд проекта с gulp'
  },
  cmg: {
    title: 'Web-разработчик',
    description: 'Работа в международном digital-агентстве в качестве удалённого web-разработчика для построения и поддержки проектов компании. Среди клиентов были такие бренды как: SAP, Procter&amp;Gamble, Pedigree, WesternUnion, Gillette, Olay, Tchibo, Chesterfield, AlfaBank и др.',
    achievements: 'Обязанности и достижения',
    a1: 'Был техническим лидером и основным разработчиком внутренней CRM системы для менеджмента человеческих ресурсов, определения свободных "рук", распределения задач.',
    a2: 'Участие в разработке новой корпоративной CMS системы, основанной на фреймворке Yii 1.х.',
    a3: 'Была реализована внутренняя система для менеджмента событий, генерации отчетов, просмотра статистики для компании SAP.',
    a4: 'Создание JS библиотеки для загрузки видео напрямую на YouTube.',
    a5: 'Western Union Stimul - внутренний корпоративный сайт, разработанный для партнёров и персонала, работающих в WU по трансферу денег в России.',
    a6: 'Технический лидер сайта TaxCom для российских бухгалтеров.',
    a7: 'Была создана <a href="https://zlob.in/2013/01/utilita-bcp-dlya-eksportaimporta-v-mssql/" rel="nofollow" target="_blank">BSP утилита</a> для экстремально быстрого экспорта/импорта в MSSQL.',
    a8: 'Создание <a href="https://github.com/Zlobin/photo-module" rel="nofollow" target="_blank">JS модуля</a> для работы с фотографиями для компании Честерфилд: кроппинг, смена цвета и пр.',
    a9: 'Разработка приложений, игр, используя API соц. сетей: FB, VK, OK.',
    place: 'Москва, Россия',
    years: 'лет <br>на этой работе',
    stack: 'Используемые технологии'
  },
  nitka: {
    title: 'Старший web-разработчик',
    description: 'Работаю как удалённый сотрудник на контрактной основе в компании, специализирующейся на предоставлении доступа к электронному контенту для учёных и университетов по различным видам дисциплин.',
    achievements: 'Обязанности и достижения',
    a1: 'Участие в разработке мобильного приложения для просмотра видео с использованием Ionic 2 и Angular 2.',
    a2: 'Технический лидер приложения "Universal Content Viewer" для просмотра различного типа контента: pdf, html и текст. PDF модуль базируется на библиотеке от Mozilla <a href="https://mozilla.github.io/pdf.js/" rel="nofollow" target="_blank">pdf.js</a>.',
    a3: 'Было полностью переписано приложение созданное на vanilla-js (<a href="https://github.com/openlibrary/bookreader" rel="nofollow" target="_blank">OpenLibrary BookReader</a>) в Backbone стэк.',
    a4: 'Найдено и устранено проблемное место, замедляющее работу скрипта при рендеринге pdf компонента. Увеличена скорость рендеринга страниц в 5 раз.',
    a5: 'Внедрение тестового окружения для проекта UCV: mocha, sinon, chai, phantomjs.',
    a6: 'Создан jQuery плагин (<a href="https://github.com/Zlobin/jBooklet" rel="nofollow" target="_blank">jBooklet</a>) для просмотра страниц в двухстраничном режиме.',
    a7: 'Создан npm <a href="https://www.npmjs.com/package/gulp-tojst" rel="nofollow" target="_blank">gulp-tojst</a> плагин для компиляции lodash (underscore) шаблонов в единый JST файл.',
    a8: 'Проведена работа по улучшению доступности сайта для людей с ограниченными возможностями (<a href="https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA" rel="nofollow" target="_blank">WAI-ARIA</a>).',
    a9: 'Разработка АПИ на Symfony 2 для работы напрямую с удалённым сервером MSSQL. Была решена <a href="https://zlob.in/2013/03/podklyuchenie-iz-php-k-mssql/" rel="nofollow" target="_blank">проблема</a> с подключением из PHP к MSSQL серверу.',
    a10: 'Миграция с grunt на gulp, для этого случая была подготовлена специальный сборка <a href="https://github.com/Zlobin/FrontEndStarterKit" rel="nofollow" target="_blank">FrontEnd Starter Kit</a>.',
    now: 'по наст. вр.',
    place: 'Нью-Йорк, США',
    years: 'лет <br>на этой работе',
    stack: 'Используемые технологии'
  },
  finist: {
    title: 'Web-разработчик',
    description: 'Web-студия по разработке небольших сайтов для малого, среднего бизнеса и государственных структур.',
    achievements: 'Обязанности и достижения',
    a1: 'Система удалённого обучения. Особенности: прогресс в режиме реального времени, сохранение состояния тестирование даже при обрыве интернет соединения.',
    a2: 'Сайт по продаже автомобилей с аукционов по всему миру (в основном по Японии). Был сделан real-time чат, большое количество парсеров для сайтов.',
    a3: 'Разработка множества корпоративных сайтов и сайтов для государственных учереждений - LAMP стэк.',
    name: 'ТОО «Компания Финист»',
    place: 'Павлодар, Казахстан',
    years: 'лет <br>на этой работе',
    stack: 'Используемые технологии'
  },
  lrw: {
    title: 'Лос-Анжелес, США',
    more: 'больше...',
    job: 'Финализации корпоративного сайта и блога.',
    time: 'Время разработки',
    stack: 'Используемые технологии'
  },
  newsmedia: {
    title: 'Москва, Россия',
    subtitle: 'Медиа холдинг',
    more: 'больше...',
    job: 'Управление группой из 6 разработчиков для завершения социальной сети для Русского Географического Общества в крайне сжатые сроки.',
    time: 'Время разработки',
    stack: 'Используемые технологии'
  },
  kelly: {
    title: '«Kelly Street Digital»: Сидней, Австралия',
    more: 'больше...',
    job: 'Разработка парсера для самописного языка и дальнейшее внедрение в Drupal.',
    time: 'Время разработки',
    stack: 'Используемые технологии'
  },
  personal: {
    title: 'Личные навыки',
    skills: 'Ориентированный на результат, инициативный, с активной жизненной позицией, само-мотивированный с уклоном на аналитику и решение проблем. Обладаю стрессо-устойчивостью и возможностью работать с высокой степенью ответственности.'
  },
  career: {
    description: 'Карьера (более <span id="career-experience"></span> лет опыта)'
  },
  education: {
    title: 'Образование',
    university: 'Бакалавр «Вычислительной Техники и Программного Обеспечения» в <a href="http://ineu.edu.kz/" rel="nofollow" target="_blank">Инновационном Евразийском Университете</a>, 2005 - 2009 (Павлодар, Казахстан).',
    lang: 'Языки',
    ru: 'Русский (родной)',
    en: 'Английский (могу пройти интервью)',
    conferences: 'Конференции',
    russia: 'Россия',
    novosibirsk: 'Новосибирск',
    moscow: 'Москва'
  },
  about: {
    title: 'JavaScript, node.js разработчик',
    years: 'лет'
  },
  stack: {
    title: 'Навыки'
  }
};
